# ScheduleFieldsParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ScheduleFieldsParam Property
ParameterTypeId Class See Also
---
"Fields"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ScheduleFieldsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ScheduleFieldsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ScheduleFieldsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace